In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'state' : ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'year' : [2000, 2001, 2002, 2001, 2002],
    'pop' : [1.5, 1.7, 3.6, 2.4, 2.9]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

### Converting dataframe into csv file

In [6]:
df.to_csv('year-wise-pop-data.csv')

### reading CSV file

In [15]:
df2 = pd.read_csv('year-wise-pop-data.csv')

In [16]:
df2

   Unnamed: 0   state  year  pop
0           0    Ohio  2000  1.5
1           1    Ohio  2001  1.7
2           2    Ohio  2002  3.6
3           3  Nevada  2001  2.4
4           4  Nevada  2002  2.9

In [19]:
df2.drop(3, axis=0, inplace=True) # either row or column : axis=1 : columns, and axis=0 will check for indicies

In [20]:
df2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
4  Nevada  2002  2.9

#### inplace=True : this will make changes in original dataframe

In [21]:
df2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
4  Nevada  2002  2.9

In [26]:
df2.tail(10)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
4  Nevada  2002  2.9

In [25]:
df2.head(10)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
4  Nevada  2002  2.9

In [27]:
df2.describe() ### numerical description about data

              year       pop
count     4.000000  4.000000
mean   2001.250000  2.425000
std       0.957427  0.997914
min    2000.000000  1.500000
25%    2000.750000  1.650000
50%    2001.500000  2.300000
75%    2002.000000  3.075000
max    2002.000000  3.600000

In [28]:
df2.info() ## will give information about data-type, memory usage, null columns, non-null columns, number of columns

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   4 non-null      object
 1   year    4 non-null      int64
 2   pop     4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ bytes